13/data/attachments/42af1fcfb5aa8c31.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_23538b83-ec07-4fce-aea3-a1b54bbc0466</nif:username>
            <nif:friendToBeAdded>Justin_attorney_Friend_8164_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>